Revit 2027 API
StairsType.HasMiddleSupports Property
 True if the stairs type has middle supports, False otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasMiddleSupports { get; set; }
Public Property HasMiddleSupports As Boolean
	Get
	Set
public:
property bool HasMiddleSupports {
	bool get ();
	void set (bool value);
}
member HasMiddleSupports : bool with get, set
Property Value
Boolean
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace